aysagent/meshpn/device/boards/waveshare_esp32_p4_wifi6/sdkconfig.defaults
# Waveshare ESP32-P4-WIFI6 (ESP32-P4NRW32 + ESP32-C6 over SDIO)

CONFIG_IDF_TARGET="esp32p4"
CONFIG_MESHVPN_BOARD_WAVESHARE_ESP32_P4_WIFI6=y
# CONFIG_MESHVPN_BOARD_XIAO_ESP32S3 is not set
# CONFIG_MESHVPN_BOARD_M5_STAMP_P4_C6 is not set

# ESP32-P4NRW32: 32 MiB in-package flash and 32 MiB in-package PSRAM.
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
# ESP-IDF 5.4 still gates the P4's supported 200 MHz PSRAM mode behind this
# feature switch. Without it Kconfig silently falls back to 20 MHz.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# USB 2.0 High-Speed device controller on the dedicated four-pin connector.
CONFIG_TINYUSB_RHPORT_HS=y
# CONFIG_TINYUSB_RHPORT_FS is not set
CONFIG_TINYUSB_MODE_DMA=y
CONFIG_TINYUSB_TASK_AFFINITY_CPU1=y
CONFIG_TINYUSB_INIT_IN_DEFAULT_TASK=y
CONFIG_TINYUSB_TASK_PRIORITY=6

# ESP32-C6 radio coprocessor. esp_hosted 1.4.x defaults already match the
# Waveshare wiring; keep the values explicit so schematic changes fail visibly.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54

# Remote Wi-Fi buffers mirror the vendor P4 profile. Both STA and SoftAP are
# required by MeshPN, so ESP_WIFI_SOFTAP_SUPPORT remains enabled.
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# UART0 is connected to the CH343P on the USB-C programming/debug connector.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
